# DO NOT RUN ALL THE CELLS. THE DATABASE TABLES WILL GET AFFECTED

Master the SQL Queries to the fullest extent. The code snippets that follow are based on the data tables from the Orielly Book "SQL Cookbook_ Query Solutions and Techniques for All SQL Users"

Tables used in their examples are created by another programmer, which I have taken for using it in the examples provided in the book. Idea is to use this note book as a reference. Since it is following a cook book that is practical, there will be many lessons to be learnt and remembered.

Tables are created inside the database.

a) EMP
b) DEPT

Pivot Tables

T1, T10 and T100

In [1]:
# To setup the sql server with the database having the tables mentioned by the book. 
import sqlite3
from sqlite3 import Error


def create_connection(db_file):
    """ create a database connection to a SQLite database """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
    finally:
        if conn:
            conn.close()

In [2]:
create_connection(r"C:\WorkFiles\WPy64-37120\notebooks\Datagathering_Automation\master-sql\Orielly_database.db")

2.6.0

!pip install ipython-sql

In [4]:
import sqlalchemy
sqlalchemy.create_engine('sqlite:///Orielly_database.db')

Engine(sqlite:///Orielly_database.db)

In [7]:
%load_ext sql

In [9]:
%sql sqlite:///Orielly_database.db

In [31]:
%%sql

SELECT *
FROM EMP

 * sqlite:///Orielly_database.db
Done.

[(7369, 'SMITH', 'CLERK', 7902, '1980-12-17', 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '1981-2-20', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '1981-2-22', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '1981-4-2', 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '1981-9-28', 1250, 1400, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, '1981-5-1', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '1981-6-9', 2450, None, 10),
 (7698, 'BLAKE', 'MANAGER', 7839, '1981-5-1', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '1981-6-9', 2450, None, 10),
 (7839, 'KING', 'PRESIDENT', None, '1981-11-17', 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '1981-9-8', 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '1983-1-12', 1100, None, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '1983-1-12', 1100, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, '1982-1-23', 1300, None, 10),
 (7900, 'JAMES', 'CLERK', 7698, '1981-12-3', 950, None, 30),
 (7902, 'FORD', 'ANALYST', 7566, '1981-12-3', 3000, None, 20)]

In [12]:
result = %sql SELECT * FROM EMP 
type(result)

 * sqlite:///Orielly_database.db
Done.

sql.run.ResultSet

In [16]:
df = result.DataFrame()

In [17]:
df.head()

   EMPNO   ENAME       JOB   MGR    HIREDATE   SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902  1980-12-17   800     NaN      20
1   7499   ALLEN  SALESMAN  7698   1981-2-20  1600   300.0      30
2   7521    WARD  SALESMAN  7698   1981-2-22  1250   500.0      30
3   7566   JONES   MANAGER  7839    1981-4-2  2975     NaN      20
4   7654  MARTIN  SALESMAN  7698   1981-9-28  1250  1400.0      30

In [19]:
%%sql
INSERT INTO EMP (EMPNO, ENAME, JOB, MGR, HIREDATE, SAL, COMM, DEPTNO) 
VALUES (7698, 'BLAKE',  'MANAGER',   7839,
        '1981-5-1',  2850, NULL, 30)

 * sqlite:///Orielly_database.db
1 rows affected.

[]

In [32]:
%%sql
CREATE TABLE DEPT
       (DEPTNO integer,
        DNAME VARCHAR(14),
        LOC VARCHAR(13) )

 * sqlite:///Orielly_database.db
Done.

[]

In [33]:
%%sql
INSERT INTO DEPT VALUES (10, 'ACCOUNTING', 'NEW YORK')

 * sqlite:///Orielly_database.db
1 rows affected.

[]

In [36]:
%%sql
INSERT INTO DEPT VALUES (20, 'RESEARCH',   'DALLAS')

 * sqlite:///Orielly_database.db
1 rows affected.

[]

In [37]:
%%sql

SELECT *
FROM DEPT

 * sqlite:///Orielly_database.db
Done.

[(10, 'ACCOUNTING', 'NEW YORK'),
 (40, 'OPERATIONS', 'BOSTON'),
 (30, 'SALES', 'CHICAGO'),
 (20, 'RESEARCH', 'DALLAS')]

In [41]:
%%sql
CREATE TABLE T100 (ID INTEGER)

 * sqlite:///Orielly_database.db
Done.

[]

In [ ]:
INSERT INTO T1 VALUES (1)

In [45]:
import dataset

db = dataset.connect('sqlite:///Orielly_database.db')

In [70]:
[x for x in range(1,11)]

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [76]:
for item in range(1,11):
    db['T10'].insert({'ID':item})

In [77]:
for item in range(1,101):
    db['T100'].insert({'ID':item})